fun main() {
    //создание с использованием вторичного конструктора
    val p1 = Person(Fio("Иванов Иван Иванович"),56,"муж",Passport("4334","454545"),
        mutableListOf(Duty("Собаковод","14",30000)))
    println(p1.toString())

    //добавление обязанностей
    println("\nНовые обязанности:\n")
    p1.addDuty(Duty("Рыболов","14",16000))
    p1.addDuty(Duty("Кошкоед","7",10000))
    println(p1.toString())

    //удаление обязанностей
    println("\nУдаление обязанности:\n")
    p1.removeDuty("Рыболов")
    println(p1.toString())

    //использование первичного конструктора
    val p2 = Person(Fio("Марина Михайловна Петрова"),15,"жен")
    println(p2.toString())

    //проверка валидности паспортных данных (неверный номер серии)
    val p3 = Person(Fio("Федор Семенович Сидоров"),28,"муж", Passport("12572","333333"))
    println(p3.toString())
}